"""
Во втором массиве сохранить индексы четных элементов первого массива. Например, если дан массив
со значениями 8, 3, 15, 6, 4, 2, второй массив надо заполнить значениями 0, 3, 4, 5,
(индексация начинается с нуля), т.к. именно в этих позициях первого массива стоят четные числа.
"""

# Копипаст кода, создающего массив
import random

SIZE = 10
MIN_ITEM = 0
MAX_ITEM = 100
array = [random.randint(MIN_ITEM, MAX_ITEM) for _ in range(SIZE)]
print(array)

array_even = []
for i in range(len(array)): # для каждого элемента из массива array проверяем остаток от деленя на 2
    if array[i] % 2 == 0:
        array_even.append(i)
print(array_even)